app/Controllers/AdminController.php

    public function listar_productos() {
        $categoriaId = $this->request->getGet('categoria');
        $colorId = $this->request->getGet('color');
        $producto_model = new ProductosModel();

        // filtro por categoría
        if ($categoriaId !== null && $categoriaId !== '') {
            $producto_model->where('producto_categoria', $categoriaId);
        }

        // filtro por color
        if ($colorId !== null && $colorId !== '') {
            $producto_model->where('producto_color', $colorId);
        }


        $data['producto'] = $producto_model
            ->where('producto_estado', 1)
            ->where('producto_stock >', 0)
            ->join('categorias', 'categorias.id_categoria = productos.producto_categoria')
            ->findAll();

        $categoria = new CategoriaModel();
        $data['categoria'] = $categoria->findAll();
        $color = new ColorModel();
        $data ['color'] = $color->findAll();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`producto_categoria`
WHERE `producto_categoria` = '3'
AND `producto_color` = '3'
AND `producto_estado` = 1
AND `producto_stock` > 0
SELECT *
FROM `categorias`
SELECT *
FROM `color`