app/Controllers/AdminController.php

SELECT *
FROM `categorias`
---
    public function listar_productos() {

        $categoriaId = $this->request->getGet('categoria');
        if ($categoriaId == 0 || $categoriaId == null)
        {
             $producto_model = new ProductosModel();
        $data['producto'] = $producto_model
        ->where('producto_estado', 1)
        ->where('producto_stock >', 0)
        ->join('categorias', 'categorias.id_categoria = productos.producto_categoria')
        ->findAll();

        $categoria = new CategoriaModel();
        $data['categoria'] = $categoria->findAll();