app/Controllers/VentaController.php

SELECT *
FROM `venta`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `venta`.`id_usuario`
---
    public function listar_ventas(){
        $venta = new VentaModel();
        $detalle_venta= new DetalleVentaModel();
        $data['title']= "Listado de ventas";
        $data['ventas']= $venta-> join('usuarios', 'usuarios.id_usuario = venta.id_usuario')->findAll();

SELECT *
FROM `detalle_venta`
JOIN `productos` ON `productos`.`id_producto` = `detalle_venta`.`id_producto`
WHERE `id_venta` = '3'
---
    public function listar_detalle_ventas($id=NULL){
        $venta= new VentaModel();
        $detalle_venta= new DetalleVentaModel();
        $data['title']= "Detalle de ventas";
        $data['detalle']= $detalle_venta-> where('id_venta', $id)->join('productos', 'productos.id_producto = detalle_venta.id_producto')->findAll();